tap "homebrew/services"
tap "nikitabobko/tap"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Modern, maintained replacement for ls
brew "eza"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Database migrations CLI tool
brew "golang-migrate"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Open source relational database management system
brew "mysql", restart_service: :changed
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Object-relational database system
brew "postgresql@16"
# Interpreted, interactive, object-oriented programming language
brew "python@3.12"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Cross-shell prompt for astronauts
brew "starship"
# Terminal multiplexer
brew "tmux"
# Command-line tool for Vapor (Server-side Swift web framework)
brew "vapor"
# Image format providing lossless and lossy compression for web images
brew "webp"
# AeroSpace is an i3-like tiling window manager for macOS
cask "aerospace"
go "golang.org/x/tools/gopls"
go "honnef.co/go/tools/cmd/staticcheck"
